beber007/zottaos/ZottaOS/msp430/Examples/Ball_Demo/LCD_EXP430F5438/hal_lcd_ZottaOS.c
void halLcdClearImage(int Columns, int Rows, int x, int y)
{
    int i, j, k, Current_Location;

    Current_Location = (y << 5) + (x >> 3);
    halLcdSetAddress(Current_Location);

    for (i = 0; i < Rows; i++)
    {
        //prepare to send image
        LCD_CS_RST_OUT &= ~LCD_CS_PIN;             //CS = 0 --> Start Transfer
        for (k = 0; k < 3; k++)
        {
            while (!(UCB2IFG & UCTXIFG)) ;         // Wait for TXIFG
            UCB2TXBUF = Draw_Block_Value_Macro[k]; // Load data
        }
        while (UCB2STAT & UCBUSY) ;
        LCD_CS_RST_OUT |= LCD_CS_PIN;              //CS = 1 --> Stop Transfer
        LCD_CS_RST_OUT &= ~LCD_CS_PIN;             //CS = 0 --> Start Transfer
        while (!(UCB2IFG & UCTXIFG)) ;             // Wait for TXIFG
        UCB2TXBUF = Draw_Block_Value_Macro[3];     // Load data

        //send blank line
        for (j = 0; j < Columns; j++)
        {
            LCD_MEM[LcdTableAddress++] = 0x00;
            while (!(UCB2IFG & UCTXIFG)) ;         // Wait for TXIFG
            UCB2TXBUF = 0x00;                      // Load data
            while (!(UCB2IFG & UCTXIFG)) ;         // Wait for TXIFG
            UCB2TXBUF = 0x00;                      // Load data
        }
        while (UCB2STAT & UCBUSY) ;
        LCD_CS_RST_OUT |= LCD_CS_PIN;              //CS = 1 --> Stop Transfer

        Current_Location += 0x20;
        halLcdSetAddress(Current_Location);
    }
}

/**********************************************************************//**
 * @brief  Writes Value to LCD CGRAM. Pointers internal to the LCD
 *         are also updated.
 *
 * @param  Value The value to be written to the current LCD pointer
 *
 * @return none
 *************************************************************************/

void halLcdDrawTextBlock(unsigned int Value)
{
    int temp;

    Draw_Block_Value_Macro[4] = Value >> 8;
    Draw_Block_Value_Macro[5] = Value & 0xFF;
    LCD_MEM[LcdTableAddress] = Value;

    halLcdSendCommand(Draw_Block_Value_Macro);

    LcdAddress++;
    temp = LcdAddress >> 5;                 // Divided by 0x20
    temp = temp + (temp << 4);
    // Multiplied by (1+16) and added by the offset
    LcdTableAddress = temp + (LcdAddress & 0x1F);

    // If LcdAddress gets off the right edge, move to next line
    if ((LcdAddress & 0x1F) > 0x10)
        halLcdSetAddress((LcdAddress & 0xFFE0) + 0x20);

    if (LcdAddress >= LCD_Size)
        halLcdSetAddress(0);
}

/**********************************************************************//**
 * @brief  Displays the string to the LCD starting at current location.
 *
 * Writes all the data to LCD_MEM first, then updates all corresponding
 * LCD CGRAM locations at once, in a continuous fashion.
 *
 * @param  String[]  The string to be displayed on LCD.
 *
 * @param  TextStyle Value that specifies whether the string is to be
 *                   inverted or overwritten.
 *                   - Invert    = 0x01
 *                   - Overwrite = 0x04
 *
 * @return none
 *************************************************************************/

void halLcdPrint(char String[], unsigned char TextStyle)
{
    int i, j, Counter = 0, BlockValue;
    int Address, LCD_MEM_Add, ActualAddress;
    int temp;
    char LookUpChar;

    ActualAddress = LcdAddress;
    Counter =  LcdAddress & 0x1F;
    i = 0;

    while (String[i] != 0)                  // Stop on null character
    {
        LookUpChar = fonts_lookup[String[i]];

        for (j = 0; j < FONT_HEIGHT; j++)
        {
            Address = ActualAddress + j * 0x20;
            temp = Address >> 5;
            temp += (temp << 4);

            LCD_MEM_Add = temp + (Address & 0x1F);

            BlockValue = LCD_MEM[LCD_MEM_Add];

            if (TextStyle & GRAYSCALE_TEXT)
            {
                if (TextStyle & INVERT_TEXT)
                    if (TextStyle & OVERWRITE_TEXT)
                        BlockValue = 0xAAAA - GrayScale_fonts[LookUpChar * (FONT_HEIGHT + 1) + j];
                    else
                        BlockValue |= 0xAAAA - GrayScale_fonts[LookUpChar * (FONT_HEIGHT + 1) + j];
                else
                if (TextStyle & OVERWRITE_TEXT)
                    BlockValue = GrayScale_fonts[LookUpChar * (FONT_HEIGHT + 1) + j];
                else
                    BlockValue |= GrayScale_fonts[LookUpChar * (FONT_HEIGHT + 1) + j];
            }
            else
            {
                if (TextStyle & INVERT_TEXT)
                    if (TextStyle & OVERWRITE_TEXT)
                        BlockValue = 0xFFFF - fonts[LookUpChar * 13 + j];
                    else
                        BlockValue |= 0xFFFF - fonts[LookUpChar * 13 + j];

                else
                if (TextStyle & OVERWRITE_TEXT)
                    BlockValue = fonts[LookUpChar * (FONT_HEIGHT + 1) + j];
                else
                    BlockValue |= fonts[LookUpChar * (FONT_HEIGHT + 1) + j];
            }
            halLcdDrawBlock(Address, BlockValue);
        }

        Counter++;
        if (Counter == 17)
        {
            Counter = 0;
            ActualAddress += 0x20 * FONT_HEIGHT  - 16;
            if (ActualAddress > LCD_Last_Pixel - 0x20 * FONT_HEIGHT)
                ActualAddress = 0;
        }
        else
            ActualAddress++;
        i++;
    }
    halLcdSetAddress(ActualAddress);

}

/**********************************************************************//**
 * @brief  Displays the string to the LCD starting at (x,y) location.
 *
 * Writes all the data to LCD_MEM first, then updates all corresponding
 * LCD CGRAM locations at once, in a continuous fashion.
 *
 * @param  String[]  String to be displayed on LCD
 *
 * @param  x         x-coordinate of the write location on the LCD
 *
 * @param  y         y-coordinate of the write location on the LCD
 *
 * @param  TextStyle Value that specifies whether the string is to be
 *                   inverted or overwritten.
 *                   - Invert    = 0x01
 *                   - Overwrite = 0x04
 *************************************************************************/

void halLcdPrintXY(char String[], int x, int y, unsigned char TextStyle)
{
    //Each line increments by 0x20
    halLcdSetAddress((y << 5) + (x >> 3));  //Narrow down to 8 possible pixels
    halLcdPrint(String,  TextStyle);
}

/**********************************************************************//**
 * @brief  Displays a string on the LCD on the specified line.
 *
 * @param  String[]  The string to be displayed on LCD.
 *
 * @param  Line      The line on the LCD on which to print the string.
 *
 * @param  TextStyle Value that specifies whether the string is to be
 *                   inverted or overwritten.
 *                   - Invert    = 0x01
 *                   - Overwrite = 0x04
 *
 * @return none
 *************************************************************************/

