beber007/zottaos/ZottaOS/msp430/Examples/Ball_Demo/LCD_EXP430F5438/hal_lcd_ZottaOS.c
void halLcdPrintLine(char String[], unsigned char Line, unsigned char TextStyle)
{
    int temp;

    temp = Line * FONT_HEIGHT;
    halLcdSetAddress(temp << 5);            // 0x20 = 2^5
    halLcdPrint(String, TextStyle);
}

/**********************************************************************//**
 * @brief  Prints a string beginning on a given line and column.
 *
 * @param  String[]  The string to be displayed on LCD.
 *
 * @param  Line      The line on which to print the string of text
 *
 * @param  Col       The column on which to print the string of text
 *
 * @param  TextStyle Value that specifies whether the string is to be
 *                   inverted or overwritten.
 *                   - Invert    = 0x01
 *                   - Overwrite = 0x04
 *
 * @return none
 *************************************************************************/

void halLcdPrintLineCol(char String[], unsigned char Line, unsigned char Col,
                        unsigned char TextStyle)
{
    int temp;

    temp = Line * FONT_HEIGHT;
    temp <<= 5;
    temp += Col;

    halLcdSetAddress(temp);                 // 0x20 = 2^5
    halLcdPrint(String, TextStyle);
}

/**********************************************************************//**
 * @brief  Draws a horizontral line from (x1,y) to (x2,y) of GrayScale level
 *
 * @param  x1        x-coordinate of the first point
 *
 * @param  x2        x-coordinate of the second point
 *
 * @param  y         y-coordinate of both points
 *
 * @param  GrayScale Grayscale level of the horizontal line
 *
 * @return none
 *************************************************************************/

void halLcdHLine(int x1, int x2, int y, unsigned char GrayScale)
{
    int x_dir, x;

    if (x1 < x2)
        x_dir = 1;
    else
        x_dir = -1;
    x = x1;
    while (x != x2)
    {
        halLcdPixel(x, y, GrayScale);
        x += x_dir;
    }
}

/**********************************************************************//**
 * @brief  Draws a vertical line from (x,y1) to (x,y2) of GrayScale level
 *
 * @param  x         x-coordinate of both points
 *
 * @param  y1        y-coordinate of the first point
 *
 * @param  y2        y-coordinate of the second point
 *
 * @param  GrayScale GrayScale level of the vertical line
 *
 * @return none
 *************************************************************************/

void halLcdVLine(int x, int y1, int y2, unsigned char GrayScale)
{
    int y_dir, y;

    if (y1 < y2)
        y_dir = 1;
    else
        y_dir = -1;
    y = y1;
    while (y != y2)
    {
        halLcdPixel(x, y, GrayScale);
        y += y_dir;
    }
}

/**********************************************************************//**
 * @brief  Draws a line from (x1,y1) to (x2,y2) of GrayScale level.
 *
 * Uses Bresenham's line algorithm.
 *
 * @param  x1         x-coordinate of the first point
 *
 * @param  y1         y-coordinate of the first point
 *
 * @param  x2         x-coordinate of the second point
 *
 * @param  y2         y-coordinate of the second point
 *
 * @param  GrayScale  Grayscale level of the line
 *
 * @return none
 *************************************************************************/

void halLcdLine(int x1, int y1, int x2, int y2, unsigned char GrayScale)
{
    int x, y, deltay, deltax, d;
    int x_dir, y_dir;

    if (x1 == x2)
        halLcdVLine(x1, y1, y2, GrayScale);
    else
    {
        if (y1 == y2)
            halLcdHLine(x1, x2, y1, GrayScale);
        else                                // a diagonal line
        {
            if (x1 > x2)
                x_dir = -1;
            else x_dir = 1;
            if (y1 > y2)
                y_dir = -1;
            else y_dir = 1;

            x = x1;
            y = y1;
            deltay = ABS(y2 - y1);
            deltax = ABS(x2 - x1);

            if (deltax >= deltay)
            {
                d = (deltay << 1) - deltax;
                while (x != x2)
                {
                    halLcdPixel(x, y,  GrayScale);
                    if (d < 0)
                        d += (deltay << 1);
                    else
                    {
                        d += ((deltay - deltax) << 1);
                        y += y_dir;
                    }
                    x += x_dir;
                }
            }
            else
            {
                d = (deltax << 1) - deltay;
                while (y != y2)
                {
                    halLcdPixel(x, y, GrayScale);
                    if (d < 0)
                        d += (deltax << 1);
                    else
                    {
                        d += ((deltax - deltay) << 1);
                        x += x_dir;
                    }
                    y += y_dir;
                }
            }
        }
    }
}

/**********************************************************************//**
 * @brief  Draw a circle of Radius with center at (x,y) of GrayScale level.
 *
 * Uses Bresenham's circle algorithm
 *
 * @param  x         x-coordinate of the circle's center point
 *
 * @param  y         y-coordinate of the circle's center point
 *
 * @param  Radius    Radius of the circle
 *
 * @param  GrayScale Grayscale level of the circle
 *************************************************************************/

void halLcdCircle(int x, int y, int Radius, int GrayScale)
{
    int xx, yy, ddF_x, ddF_y, f;

    ddF_x = 0;
    ddF_y = -(2 * Radius);
    f = 1 - Radius;

    xx = 0;
    yy = Radius;
    halLcdPixel(x + xx, y + yy, GrayScale);
    halLcdPixel(x + xx, y - yy, GrayScale);
    halLcdPixel(x - xx, y + yy, GrayScale);
    halLcdPixel(x - xx, y - yy, GrayScale);
    halLcdPixel(x + yy, y + xx, GrayScale);
    halLcdPixel(x + yy, y - xx, GrayScale);
    halLcdPixel(x - yy, y + xx, GrayScale);
    halLcdPixel(x - yy, y - xx, GrayScale);
    while (xx < yy)
    {
        if (f >= 0)
        {
            yy--;
            ddF_y += 2;
            f += ddF_y;
        }
        xx++;
        ddF_x += 2;
        f += ddF_x + 1;
        halLcdPixel(x + xx, y + yy, GrayScale);
        halLcdPixel(x + xx, y - yy, GrayScale);
        halLcdPixel(x - xx, y + yy, GrayScale);
        halLcdPixel(x - xx, y - yy, GrayScale);
        halLcdPixel(x + yy, y + xx, GrayScale);
        halLcdPixel(x + yy, y - xx, GrayScale);
        halLcdPixel(x - yy, y + xx, GrayScale);
        halLcdPixel(x - yy, y - xx, GrayScale);
    }
}


/**********************************************************************//**
 * @brief  Draws a filled circle centered at (x,y) given its radius with a specified
 *         GrayScale level using Bresenham's circle algorithm.
 *
 * @param  x         x-coordinate of the circle's center point
 *
 * @param  y         y-coordinate of the circle's center point
 *
 * @param  radius    Radius of the circle
 *
 * @param  grayScale Grayscale level of the circle
 *************************************************************************/

void halLcdFilledCircle(int x, int y, int radius, int grayScale)
{
    int xx = 0, yy, ddF_x = 0, ddF_y, f = 1 - radius;
    ddF_y = -2 * radius;
    yy = radius;
    halLcdHLine(x-yy,x+yy,y-xx,grayScale);
    halLcdHLine(x-xx,x+xx,y-yy,grayScale);
    halLcdHLine(x-yy,x+yy,y+xx,grayScale);
    halLcdHLine(x-xx,x+xx,y+yy,grayScale);
    while (xx <= yy) {
       if (f >= 0) {
          yy--;
          ddF_y += 2;
          f += ddF_y;
       }
       xx++;
       ddF_x += 2;
       f += ddF_x + 1;
       halLcdHLine(x-yy,x+yy,y-xx,grayScale);
       halLcdHLine(x-xx,x+xx,y-yy,grayScale);
       halLcdHLine(x-yy,x+yy,y+xx,grayScale);
       halLcdHLine(x-xx,x+xx,y+yy,grayScale);
    }
}

/**********************************************************************//**
 * @brief  Draws a filled circle centered at (x,y) given its radius with a specified
 *         GrayScale level using Bresenham's circle algorithm. This function is recom-
 *         manded for circles having radii < 12 because no identical lines are displayed.
 *
 * @param  x         x-coordinate of the circle's center point
 *
 * @param  y         y-coordinate of the circle's center point
 *
 * @param  radius    Radius of the circle
 *
 * @param  grayScale Grayscale level of the circle
 *************************************************************************/

#define MaxSmallFilledCircle 12
void halLcdFilledSmallCircle(int x, int y, int radius, int grayScale)
{
  unsigned char minXCoord[MaxSmallFilledCircle];
  int xx = 0, yy, ddF_x = 0, ddF_y = 0, f = 1 - radius;
  ddF_y = -2 * radius;
  for (yy = 0; yy <= radius; yy += 1)
     minXCoord[yy] = x;
  yy = radius;
  minXCoord[radius-xx] = x - yy;
  minXCoord[radius-yy] = x-xx;
  while (xx < yy) {
     if (f >= 0) {
        yy--;
        ddF_y += 2;
        f += ddF_y;
     }
     ddF_x += 2;
     f += ddF_x + 1;
     xx++;
     if (minXCoord[radius-xx] > x - yy) minXCoord[radius-xx] = x - yy;
     if (minXCoord[radius-yy] > x - xx) minXCoord[radius-yy] = x - xx;
  }
  f = x << 1;
  for (yy = y - radius, xx = 0; xx < radius; yy += 1, xx += 1)
     halLcdHLine(minXCoord[xx],f-minXCoord[xx],yy,grayScale);
  for (xx = radius; xx >= 0; yy += 1, xx -= 1)
     halLcdHLine(minXCoord[xx],f-minXCoord[xx],yy,grayScale);
}

/************************************************************************
 * @brief  Scrolls a single row of pixels one column to the left.
 *
 * The column that is scrolled out from the left side of the LCD will be
 * displayed on the right side of the LCD.
 *
 * @param  y               The row of pixels to scroll. y = 0 is at the top-left
 *                         corner of the LCD.
 *
 * @param  nbScroll        Number of pixels to scroll (max = 8)
 *
 * @param  nbCharToScroll  Number of chars to scroll
 *
 * @param  hiddenChar      Hidden char buffer. Must be initialize before function call.
 *
 * @param  hiddenCharSize  Number of hidden chars
 *
 * @return none
 *************************************************************************/

void halLcdScrollRow(int y, int nbScroll, int nbCharToScroll, unsigned int hiddenChar[][FONT_HEIGHT], int hiddenCharSize)
{
    int shiftRead, shiftWrite, i, j, Address, LcdTableAddressTemp;
    unsigned int maskRead, maskWrite, temp;
    
