beber007/zottaos/ZottaOS/msp430/Examples/Ball_Demo/LCD_EXP430F5438/hal_lcd_ZottaOS.c
    /* Initialize shift and mask with the number of scroll nbScroll */
    shiftRead = 16 - (nbScroll << 1);
    shiftWrite = nbScroll << 1;
    maskRead = (0xFFFF >> shiftRead);
    maskWrite = (0xFFFF << shiftWrite);

    Address = y << 5;

    halLcdSetAddress(Address);

    // Multiply by (1+16)
    LcdTableAddressTemp = y + (y << 4);
    
    if (hiddenCharSize > 0) {
       temp = (hiddenChar[0][y] & maskRead) << shiftRead;
       for (j = 0; j < hiddenCharSize - 1; j++) // Scroll hidden char
          hiddenChar[j][y] = ((hiddenChar[j][y] & maskWrite) >> shiftWrite) + ((hiddenChar[j + 1][y] & maskRead) << shiftRead);
       hiddenChar[hiddenCharSize - 1][y] = ((hiddenChar[hiddenCharSize - 1][y] & maskWrite) >> shiftWrite) + ((LCD_MEM[LcdTableAddressTemp] & maskRead) << shiftRead);
    }
    else // no hidden char
       temp = ((LCD_MEM[LcdTableAddressTemp] & maskRead) << shiftRead);

    for (i = 0; i < nbCharToScroll; i++) // scroll displayed char
       halLcdDrawCurrentBlock(((LCD_MEM[LcdTableAddressTemp + i] & maskWrite) >> shiftWrite) + ((LCD_MEM[LcdTableAddressTemp + i + 1] & maskRead) << shiftRead));

    halLcdDrawCurrentBlock(((LCD_MEM[LcdTableAddressTemp + nbCharToScroll] & maskWrite) >> shiftWrite) + temp);
}

/**********************************************************************//**
 * @brief  Scrolls multiple row of pixels, yStart to yEnd,
 *         one column to the left.
 *
 * The column that is scrolled out of the left side of the LCD will be
 * displayed the right side of the LCD. y = 0 is at the top-left of the
 * LCD screen.
 *
 * @param  yStart          The beginning row to be scrolled
 *
 * @param  yEnd            The last row to be scrolled
 *
 * @param  nbScroll        Number of pixels to scroll (max = 8)
 *
 * @param  nbCharToScroll  Number of chars to scroll
 *
 * @return none
 *************************************************************************/

void halLcdHScroll(int yStart, int yEnd, int nbScroll, int nbCharToScroll)
{
    int i;

    for (i = yStart; i < yEnd + 1; i++)
        halLcdScrollRow(i,nbScroll,nbCharToScroll,0x0,0);
}

/**********************************************************************//**
 * @brief  Scrolls a line of text one column to the left.
 *
 * @param  Line            The line of text to be scrolled.
 *
 * @param  nbScroll        Number of pixels to scroll (max = 8)
 *
 * @param  nbCharToScroll  Number of chars to scroll
 *
 * @param  hiddenChar      Hidden char buffer. Must be initialized before function call.
 *
 * @param  hiddenCharSize  Number of hidden chars.
 *
 * @return none
 *************************************************************************/


void halLcdScrollLine(int Line, int nbScroll, int nbCharToScroll, unsigned int hiddenChar[][FONT_HEIGHT], int hiddenCharSize)
{
    int i, Row;

    Row = Line * FONT_HEIGHT;

    for (i = Row; i < Row + FONT_HEIGHT; i++)
        halLcdScrollRow(i,nbScroll,nbCharToScroll,hiddenChar,hiddenCharSize);
}

